Центр_управления_производительностью_демо/src/Documents/Взаимоблокировка/Взаимоблокировка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Взаимоблокировка</name>
  <attributes>
    <name>Граф</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>МоментВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВзаимоблокировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипБлокировки</name>
    <type>
      <types>EnumRef.ТипыБлокировок</types>
    </type>
  </attributes>
  <attributes>
    <name>Хеш</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Блокировки</name>
    <attributes>
      <name>Блокировка</name>
      <type>
        <types>DocumentRef.Блокировка</types>
      </type>
    </attributes>
    <attributes>
      <name>БлокирующийПроцесс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Процесс</name>
      <comment>Идентификатор процесса. Объединяет разные блокировки в одну транзакцию</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойствоПроцесса</name>
    <attributes>
      <name>НомерПроцесса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Центр_управления_производительностью_демо/src/Enums/ТипыБлокировок/ТипыБлокировок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыБлокировок</name>
  <enumValues>
    <name>БлокировкаСУБД</name>
  </enumValues>
  <enumValues>
    <name>Блокировка1СПредприятия</name>
  </enumValues>
</mdclass:Enum>

Центр_управления_производительностью_демо/src/Documents/Взаимоблокировка/ObjectModule.bsl
Перем мЭтоНовый; // Флаг, записан ли документ в базу данных.


// Процедура обработки события ПередЗаписью документа.
// Определяет записан ли документ в базу данных.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мЭтоНовый = ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью()

// Процедура обработки события ПриЗаписи документа.
// Записать движение в регистры.
//
Процедура ПриЗаписи(Отказ)
	
	Перем ПричинаОшибки;
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// Получить ссылку на показатель производительности
	Если ТипБлокировки = Перечисления.ТипыБлокировок.Блокировка1СПредприятия Тогда
		Показатель = Справочники.Показатели.АнализВзаимоблокировок1С;
	Иначе
		Показатель = Справочники.Показатели.АнализВзаимоблокировок;
	КонецЕсли;
	Значение = 1;
	
	Попытка
		ЖурналПоказателей.ЗаписатьЗначениеПоказателяАнализа(
			ЭтотОбъект,
			мЭтоНовый,
			Показатель,
			Значение);
	Исключение
		Отказ = Истина;
		ВызватьИсключение;
	КонецПопытки
	
КонецПроцедуры // ПриЗаписи()

// Процедура обработки события ПередУдалением документа.
// Удаляет движения документа.
//
Процедура ПередУдалением(Отказ)
	
	Перем ПричинаОшибки;
	
	// Получить ссылку на показатель производительности
	Показатель = Справочники.Показатели.АнализВзаимоблокировок;
	Значение = 1;
	
	Попытка
		ЖурналПоказателей.УдалитьЗначениеПоказателяАнализа(
			ЭтотОбъект,
			мЭтоНовый,
			Показатель,
			Значение);
	Исключение
		Отказ = Истина;
		ВызватьИсключение;
	КонецПопытки
	
КонецПроцедуры // ПередУдалением()
